---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.#ctor
source: html/ee8e33d6-ab5a-e47e-e67b-44cf22c3b642.htm
---
# Autodesk.Revit.DB.MullionTypeSet.#ctor Method

Initializes a new instance of the MullionTypeSet class

## Syntax (C#)
```csharp
public MullionTypeSet()
```